---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DrawForEachRun
source: html/10f898a9-ed7d-787e-7e41-bb61da93894d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DrawForEachRun Property

"Draw for Each Run"

## Syntax (C#)
```csharp
public static ForgeTypeId DrawForEachRun { get; }
```